package com.wiseweb.util;

/**
 * Created by Chory on 2017/2/7 0007.
 * 手机分辨率生成器
 */
public class ResolutionBuilder {

    /**
     * 3.5英寸分辨率为960x640(DVGA) 像素密度326PPI（苹果 iphone4）
     3.7英寸分辨率为800x480(WVGA) 像素密度252PPI
     3.7英寸分辨率为800x480(WVGA) 像素密度252PPI
     3.7英寸分辨率为960x540(qHD) 像素密度298PPI
     4.0英寸分辨率为800x480(WVGA) 像素密度233PPI
     4.0英寸分辨率为854x480(WVGA) 像素密度245PPI
     4.0英寸分辨率为960x540(qHD) 像素密度275PPI
     4.0英寸分辨率为1136x640(HD) 像素密度330PPI（苹果 iphone5）
     4.2英寸分辨率为960x540(qHD) 像素密度262PPI
     4.3英寸分辨率为800x480(WVGA) 像素密度217PPI
     4.3英寸分辨率为960x640(qHD) 像素密度268PPI
     4.3英寸分辨率为960x540(qHD) 像素密度256PPI
     4.3英寸分辨率为1280x720(HD) 像素密度342PPI
     4.5英寸分辨率为960*540(qHD) 像素密度245PPI
     4.5英寸分辨率为1280x720(HD) 像素密度326PPI
     4.5英寸分辨率为1920x1080(FHD) 像素密度490PPI
     4.7英寸分辨率为1280x720(HD) 像素密度312PPI
     4.7英寸分辨率为1280x720(HD) 像素密度312PPI
     4.7英寸分辨率为1280x720(HD) 像素密度312PPI
     4.8英寸分辨率为1280x720(HD) 像素密度306PPI
     5.0英寸分辨率为480x800(WVGA) 像素密度186PPI
     5.0英寸分辨率为1024x768(XGA) 像素密度256PPI
     5.0英寸分辨率为1280*720 像素密度294PPI
     5.0英寸分辨率为1920x1080(FHD) 像素密度441PPI
     5.3英寸分辨率为1280x800(WXGA) 像素密度285PPI
     5.3英寸分辨率为960x540(qHD) 像素密度207PPI
     6.0英寸分辨率为854×480 像素密度163PPI
     6.0英寸分辨率为1280 X 720 像素密度245PPI
     6.0英寸分辨率为2560×1600 像素密度498ppi
     7.0英寸分辨率为800x480(WVGA) 像素密度128PPI
     7.0英寸分辨率为1024*600 像素密度169PPI
     7.0英寸分辨率为1280*800 像素密度216PPI
     9.7英寸分辨率为1024x768(XGA)，像素密度132ppi
     9.7英寸分辨率为2048x1536， 像素密度264PPI
     10 英寸分辨率为1200X600， 像素密度170ppi
     10 英寸分辨率为2560x1600 像素密度299ppi
     */
    public static String getResolution() {

        String[] arrRes = {"960x640", "800x480", "960x540", "960*640", "1024*600", "1024*768", "1136*640", "1200*600", "1280*720", "1280*800", "1920*1080", "2048*1536","2560*1600"};

        int index = (int) (1+Math.random()*10);
        return arrRes[index];
    }
}
